# descriptions.py

CATEGORY_DESCRIPTIONS = {
    "Мука": "Мука — это основной продукт для приготовления хлеба, выпечки и других изделий. Она бывает разных видов: пшеничная, ржаная, кукурузная и т.д. При выборе муки важно учитывать её тип и производителя, так как это влияет на качество конечного продукта.",
    "Дрожжи": "Дрожжи — это живые микроорганизмы, которые используются для поднятия теста и приготовления напитков. Различные виды дрожжей могут влиять на текстуру и вкус вашего продукта.",
    "Масло": "Масло — это жир, который используется для жарки, запекания и в качестве ингредиента в различных блюдах. В нашем ассортименте вы найдете как растительное, так и сливочное масло.",
    "Яйца": "Яйца — это универсальный продукт, который используется в приготовлении множества блюд, от завтраков до выпечки. Яйца богаты белком и витаминами.",
    "Уксус": "Уксус используется в кулинарии для придания блюдам кислого вкуса и как консервант. У нас представлены различные виды уксуса, включая яблочный и бальзамический.",
    "Соль-Сода-Сахар": "Соль, сода и сахар — это основные ингредиенты, которые используются в кулинарии. Эти продукты необходимы для приготовления практически любого блюда.",
    "Консервы": "Консервы — это продукты длительного хранения, которые могут включать в себя мясо, рыбу, овощи и фрукты. У нас вы найдете широкий ассортимент консервов для вашего удобства.",
    "Томатная паста, Майонез, Соусы": "Томатная паста, майонез и соусы — это добавки, которые улучшают вкус блюд. Они могут использоваться в приготовлении пиццы, пасты и других блюд.",
    "Рис": "Рис — это основа многих блюд. В зависимости от сорта и метода приготовления, рис может стать гарниром, основным блюдом или компонентом в супах и салатах.",
    "Приправы": "Приправы — это специи и травы, которые используются для улучшения вкуса блюд. Они могут быть как острыми, так и мягкими, и добавляют уникальный аромат и вкус.",
}

MANUFACTURER_DESCRIPTIONS = {
    "Бавлинский мельничный комбинат ТАТАРСТАН": "Мука «Бавлинская» высшего сорта, производства Республики Татарстан, соответствует всем требуемым стандартам и нормам ГОСТа. Отлично подходит для любой выпечки. С этой мукой сам процесс приготовления становится настоящим удовольствием. Тесто хорошо лепится, является очень эластичным, но, в то же время упругим, поэтому с ним легко работать при создании разных хлебобулочных изделий, которые получаются рыхлыми и воздушными",
    "Городищенский комбинат хлебопродутов (Старый Оскол)": "Мука Столыпинский стандарт  произведена на Городищенском мелькомбинате (филиал Старо-оскольского мелькомбината).  Она идеально подходит для любой выпечки: хлеба, пирожков, пельменей, тортов, кексов, блинов, отличается белизной и прекрасными хлебопекарными качествами. Привлекательный внешний вид и прекрасный вкус - главные достоинства домашней и промышленной выпечки.",
    "Казахская мука": "Казахская мука предлагает широкий ассортимент продуктов, которые отличаются отличным вкусом и доступной ценой.",
    "Наш пекарь": "Мука высшего сорта Наш пекарь. Производство Бавлинского мелькомбината (Республика Татарстан). Обладает идеальными хлебопекарными свойствами. Отлично подходит для любой выпечки. Тесто хорошо лепится, является очень эластичным, но, в то же время упругим, поэтому с ним легко работать при создании разных хлебобулочных изделий",
    "Мука МАКФА": "Пшеничная мука Макфа высшего сорта. Идеально подходит для выпечки продуктов из слоеного, дрожжевого или песочного теста. Продукт имеет белый цвет и легкую консистенцию. В состав входят только качественно обработанные компоненты, благодаря чему любая выпечка приобретет необходимую форму и нежный, воздушный вкус. ",
    "Предпортовый мельничный комбинат": "Мука пшеничная высшего сорта ТМ «Предпортовая» — это мягкая белая мука тонкого помола. Изделия из такой муки — источник сил и энергетической активности, поскольку калорийная выпечка обеспечивает человеку необходимые ресурсы для движения и, как следствие, активной жизни. Такая мука является незаменимым помощником в приготовлении вкусных и ароматных блюд.",
    "Бутурлиновский мельничный комбинат": "Данная мука - это высококачественный продукт, произведенный на ОАО Бутурлиновский мелькомбинат. Этот бренд зарекомендовал себя на рынке как надежный производитель, предлагающий продукты, соответствующие высоким стандартам качества.Выбирая муку Столыпинский стандарт, вы получаете качественный продукт, который обеспечит отличный результат при приготовлении хлебобулочных изделий",
    "Мельничный комбинат имени Кирова": "Мука пшеничная ГОСТ «Кирова» - мука тонкого помола, состоящая только из внутренней части зерна. Обладает идеальными хлебопекарными свойствами, самым высоким уровнем содержания клейковины. Изделия из нее имеют хороший объем и мелкую пористость. Такую муку предпочтительнее использовать для изготовления песочного, слоеного и дрожжевого теста, сдобных изделий, соусов и мучных заправок",
    "Павло-Пассадский мельничный комбинат": "Мука пшеничная ТМ «Экопекарь» — это мягкая белая мука тонкого помола. Из муки высшего сорта получается самая нежная и воздушная выпечка, которая подходит для коржей, тортов, булочек, кексов, бисквитов. Муку можно использовать и как загуститель для соусов, заправок, макарон."

    # Добавьте описания для других производителей
}

MANUFACTURER_IMAGES = {
    "Городищенский комбинат хлебопродутов (Старый Оскол)": "photo/buturlinovskij.jpg",
    "Бавлинский мельничный комбинат ТАТАРСТАН": "photo/pshenichnaya.jpg",
    "Казахская мука": "photo/granum.jpg",
    "Наш пекарь": "photo/nashpekar.jpg",
    "Мука МАКФА": "photo/makfa.jpg",
    "Предпортовый мельничный комбинат": "photo/predportovaya.jpg",
    "Мельничный комбинат имени Кирова": "photo/Melnichnyj.jpg",
    "Павло-Пассадский мельничный комбинат": "photo/ekopekar.jpg"
}

def get_manufacturer_image(manufacturer_name: str) -> str:
    """Возвращает путь к изображению для заданного производителя."""
    return MANUFACTURER_IMAGES.get(manufacturer_name, "photo/Мука.png")

def get_category_description(category_name: str) -> str:
    """Возвращает описание для заданной категории."""
    return CATEGORY_DESCRIPTIONS.get(category_name, "Описание для этой категории отсутствует.")

def get_manufacturer_description(manufacturer_name: str) -> str:
    """Возвращает описание для заданного производителя."""
    return MANUFACTURER_DESCRIPTIONS.get(manufacturer_name, "Описание для этого производителя отсутствует.")
